# LETTers Training Report

- Date: 6 April 2018
- Author: Alice_Margatroid
- ID and Title of Contest: [LETTers 2018 Shannxi Invitational Training Round 04 for 孙宇辉&张昊坤](https://vjudge.net/contest/220605)

## Part I - 练习赛总结

### 题目总体结构分析：

- A: 概率dp
- B: 字符串处理
- C: 线段树+中国剩余定理
- D: 线段树+数论
- E: 水题，贪心
- F: 高精度，幂
- G: 贪心+DFS
- H: 高难度计算几何
- I: 找规律，分治
- J: 期望


### 练习赛中的个人状态（包括整体节奏的把握）：

相比于昨天，今天的心态就不那么好了。虽然昨天的题也比较难，但是今天的题的难度显然更高。
大概半小时的时候读完了一半的题，感觉解法都很模糊。一小时的时候读完了题，但是发现基本都不会做。

孙宇辉按照交题的榜做出了两道题。我看G题看起来比较有希望结果做着做着以为K有1e5，会超时，但是后来查了题解，好像只用遍历一遍储存结果排序之后能行，不用真操作K遍。

而倒数的两个小时内孙宇辉在卡J题，我在尝试A题，结果都没有做出来。

节奏上没什么可说的，感觉更大的是基本的水平问题。

### 与队友的协作情况：

孙宇辉很擅长推导，不过细节上容易疏忽，面对难题的时候很冷静，没有畏难情绪。

不过也因此他做题比较集中，我有时候没判断对时机和他交流容易打扰到他。以后要注意这种情况，以免干扰队友的判断。

### 其他建议：



## Part II - AC情况(只包含赛时)

